using System.Collections.Generic;
using System.Collections.ObjectModel;
using Client_App.ViewModels.Forms.Forms1.Items;

namespace Client_App.ViewModels.Forms.Forms1.Providers;

/// <summary>
/// Провайдер кодов операций для форм 1.x
/// </summary>
public static class OperationCodesProvider
{
    /// <summary>
    /// Все коды операций с описаниями
    /// </summary>
    public static ObservableCollection<OperationCodeItem> AllOperationCodes { get; } =
    [
        new() { Code = "01", Description = "Наличие на дату 31.12.2021" },

        new() { Code = "10", Description = "Инвентаризация" },

        new() { Code = "11", Description = "Изготовление / образование" },

        new() { Code = "12", Description = "Перевод из ЯМ в РВ и РАО" },

        new() { Code = "13", Description = "Образование РАО при обслуживании пунктов хранения/захоронения РАО" },

        new() { Code = "14", Description = "Постановка на учёт РАО, образовавшихся из РВ или не подлежащих учёту" },

        new() { Code = "15", Description = "Возврат в оборот РВ при переработке ОЗИИИ" },

        new() { Code = "16", Description = "Постановка на учёт РАО, образовавшихся при выводе из эксплуатации ОИАЭ " +
                                           "или реабилитации загрязнённых территорий" },

        new() { Code = "17", Description = "Постановка на учёт РВ, ранее не подлежавших учёту" },

        new() { Code = "18", Description = "Постановка на учёт при изменении характеристик по результатам измерений" },

        new() { Code = "21", Description = "Передача одним об. подразделением другому об. подразделению одного юр. лица" },

        new() { Code = "22", Description = "Передача в Министерство обороны РФ" },

        new() { Code = "25", Description = "Передача (возврат) ранее полученного от юр. лица РФ" },

        new() { Code = "26", Description = "Передача юр. лицу РФ с обязательствами по обеспечению безопасности " +
                                           "до передачи нац. оператору" },

        new() { Code = "27", Description = "Передача юр. лицу РФ без передачи права собственности" },

        new() { Code = "28", Description = "Передача юр. лицу РФ с передачей права собственности" },

        new() { Code = "29", Description = "Прочие операции по передаче" },

        new() { Code = "31", Description = "Получение одним об. подразделением от другого " +
                                           "об. подразделения того же юр. лица" },

        new() { Code = "32", Description = "Получение из Министерство обороны РФ" },

        new() { Code = "35", Description = "Получение от юр. лица РФ, без перехода права собственности " +
                                           "(иного вещного права)" },

        new() { Code = "36", Description = "Получение от юр. лица, с обязательствами по обеспечению безопасности " +
                                           "до передачи нац. оператору" },

        new() { Code = "37", Description = "Получение (возврат) ранее переданного юр. лицу РФ" },

        new() { Code = "38", Description = "Получение учётной единицы и права собственности на неё" },

        new() { Code = "39", Description = "Прочие операции по получению" },

        new() { Code = "41", Description = "Перевод РВ в РАО" },

        new() { Code = "42", Description = "Перевод из РВ и РАО в ЯМ" },

        new() { Code = "43", Description = "Снятие учётной единицы по причине естественного распада" },

        new() { Code = "44", Description = "Переработка, кондиционирование" },

        new() { Code = "45", Description = "Снятие с учёта РАО при операциях упаковки, переупаковки" },

        new() { Code = "46", Description = "Использование (разукомплектование, расфасовка) для изготовления, " +
                                           "образования учётных единиц, подлежащих учёту" },

        new() { Code = "47", Description = "Расходование" },

        new() { Code = "48", Description = "Безвозвратные потери в пределах установленных норм" },

        new() { Code = "49", Description = "Снятие с учёта РАО при операциях сортировки" },

        new() { Code = "51", Description = "Изъятие из пункта хранения" },

        new() { Code = "52", Description = "Размещение в пункте хранения" },

        new() { Code = "53", Description = "Зарядка (загрузка) / разрядка (выгрузка) организацией" },

        new() { Code = "54", Description = "Зарядка (загрузка) / разрядка (выгрузка) подрядной организацией" },

        new() { Code = "55", Description = "Приведение в соответствие критериям приемлемости РАО для захоронения" },

        new() { Code = "56", Description = "Образование РАО после переработки" },

        new() { Code = "57", Description = "Постановка на учёт РАО при операциях упаковки или переупаковки" },

        new() { Code = "58", Description = "Вторичное образование РВ" },

        new() { Code = "59", Description = "Постановка на учёт РАО при операциях сортировки" },

        new() { Code = "61", Description = "Вывоз на другую территорию" },

        new() { Code = "62", Description = "Возврат с другой территории" },

        new() { Code = "63", Description = "Передача права собственности (иного вещного права), " +
                                           "обязательств по оплате захоронения, без физического перемещения" },

        new() { Code = "64", Description = "Получение права собственности (иного вещного права), " +
                                           "обязательств по передаче РАО на захоронение, без физического перемещения" },

        new() { Code = "65", Description = "Перевод из ЗРИ в ОРИ" },

        new() { Code = "66", Description = "Продление ИСС ЗРИ/ИОУ" },

        new() { Code = "67", Description = "Перевод в РВ при проведении работ по использованию атомной энергии " +
                                           "в оборонных целях" },

        new() { Code = "68", Description = "Снятие с учёта при изменении характеристик по результатам измерений" },

        new() { Code = "71", Description = "Утеря" },

        new() { Code = "72", Description = "Утрата контроля при известном местоположении" },

        new() { Code = "73", Description = "Обнаружение неучтённого" },

        new() { Code = "74", Description = "Изъятие из незаконного оборота" },

        new() { Code = "75", Description = "Обнаружение утерянного ранее" },

        new() { Code = "76", Description = "Постановка на учёт РАО, изымаемых по указанию " +
                                           "органов исполнительной власти, надзорных органов" },

        new() { Code = "81", Description = "Экспорт" },

        new() { Code = "82", Description = "Временный вывоз из РФ" },

        new() { Code = "83", Description = "Вывоз (возврат) из РФ временно ввезённого ранее" },

        new() { Code = "84", Description = "Вывоз (возврат) ранее импортированного ЗРИ (ОЗИИИ) за рубеж" },

        new() { Code = "85", Description = "Импорт" },

        new() { Code = "86", Description = "Временный ввоз в РФ" },

        new() { Code = "87", Description = "Возврат (ввоз) в РФ временно вывезенного ранее" },

        new() { Code = "88", Description = "Ввоз (возврат) в РФ ранее экспортированного ЗРИ (ОЗИИИ)" },

        new() { Code = "97", Description = "Постановка на учёт по другим причинам" },

        new() { Code = "98", Description = "Снятие с учёта по другим причинам" },

        new() { Code = "99", Description = "Прочие операции" }
    ];

    /// <summary>
    /// Получить допустимые коды для формы 1.1
    /// </summary>
    public static ICollection<string> GetValidCodesForForm11() =>
    [
        "10", "11", "12", "15", "17", "18",
        "21", "22", "25", "27", "28", "29",
        "31", "32", "35", "37", "38", "39",
        "41", "42", "43", "46", "47", 
        "53", "54", "58",             
        "61", "62", "63", "64", "65", "66", "67", "68",
        "71", "72", "73", "74", "75", "81", "82", "83",
        "84", "85", "86", "87", "88", 
        "97", "98", "99"
    ];

    /// <summary>
    /// Получить допустимые коды для формы 1.2
    /// </summary>
    public static ICollection<string> GetValidCodesForForm12() =>
    [
        "10", "11", "12", "17", "18", 
        "21", "22", "25", "27", "28", "29", 
        "31", "32", "35", "37", "38", "39", 
        "41", "42", "46", 
        "53", "54", "58", 
        "61", "62", "63", "64", "66", "67", "68", 
        "71", "72", 
        "73", "74", "75", "81", 
        "82", "83", "84", "85", "86", "87", "88", 
        "97", "98", "99"
    ];

    /// <summary>
    /// Получить допустимые коды для формы 1.3
    /// </summary>
    public static ICollection<string> GetValidCodesForForm13() =>
    [
        "10", "11", "12", "15", "17", "18", 
        "21", "22", "25", "27", "28", "29", 
        "31", "32", "35", "37", "38", 
        "39", "41", "42", "43", "46", "47", "48", 
        "53", "54", "58", 
        "61", "62", "63", "64", "65", "67", "68", 
        "71", "72", "73", "74", "75", 
        "81", "82", "83", "84", "85", "86", "87", "88", 
        "97", "98", "99"
    ];

    /// <summary>
    /// Получить допустимые коды для формы 1.4
    /// </summary>
    public static ICollection<string> GetValidCodesForForm14() =>
    [
        "10", "11", "12", "15", "17", "18", 
        "21", "22", "25", "27", "28", "29", 
        "31", "32", "35", "37", "38", "39", 
        "41", "42", "43", "46", "47", "48", 
        "53", "54", "58", 
        "61", "62", "63", "64", "65", "67", "68", 
        "71", "72", "73", "74", "75",
        "81", "82", "83", "84", "85", "86", "87", "88", 
        "97", "98", "99"
    ];

    /// <summary>
    /// Получить допустимые коды для формы 1.5
    /// </summary>
    public static ICollection<string> GetValidCodesForForm15() =>
    [
        "01",
        "10", "14",
        "21", "22", "25", "26", "27", "28", "29",
        "31", "32", "35", "36", "37", "38", "39",
        "41", "43", "44", "45", "49",       
        "51", "52", "57", "59",             
        "63", "64", "71", "72", "73", "74", "75", "76",
        "84", "88",                         
        "97", "98", "99"
    ];

    /// <summary>
    /// Получить допустимые коды для формы 1.6
    /// </summary>
    public static ICollection<string> GetValidCodesForForm16() =>
    [
        "01",    
        "10", "11", "12", "13", "14", "16", "18",
        "21", "22", "25", "26", "27", "28", "29",
        "31", "32", "35", "36", "37", "38", "39",
        "41", "42", "43", "44", "45", "48", "49",
        "51", "52", "56", "57", "59", 
        "63", "64", "68",             
        "71", "72", "73", "74", "75", "76",
        "97", "98", "99"
    ];

    /// <summary>
    /// Получить допустимые коды для формы 1.7
    /// </summary>
    public static ICollection<string> GetValidCodesForForm17() =>
    [
        "10", "11", "12", "13", "14", "16", "18",
        "21", "22", "25", "26", "27", "28", "29",
        "31", "32", "35", "36", "37", "38", "39",
        "43", "44", "45", "51", "52", "55", "63",
        "64", "68", "71", "97", "98"
    ];

    /// <summary>
    /// Получить допустимые коды для формы 1.8
    /// </summary>
    public static ICollection<string> GetValidCodesForForm18() =>
    [
        "01",
        "10", "11", "12", "13", "18",
        "21", "25", "26", "27", "28", "29",
        "31", "32", "35", "36", "37", "38", "39",
        "42",       
        "51", "52", "55",
        "63", "64", "68",
        "97", "98"
    ];

    /// <summary>
    /// Получить допустимые коды для формы 1.9
    /// </summary>
    public static ICollection<string> GetValidCodesForForm19() =>
    [
        "10"
    ];
}