using System;
using System.Collections.Generic;
using System.Threading.Tasks;
using System.IO;
using OfficeOpenXml;

namespace Spravochniki;

public static class Spravochniks
{
    //Таблица 9. Код типа РАО
    public static Dictionary<string, string> CodesTypeRao = new Dictionary<string, string>
    {
        ["01"] = "газы, аэрозоли",
        ["11"] = "воды загрязненные подземные, в том числе грунтовые и дренажных систем",
        ["12"] = "воды охлаждения реакторного производства, контурные воды, воды цистерн биологической защиты, воды бассейнов выдержки ОЯТ",
        ["13"] = "растворы хвостовые",
        ["14"] = "конденсаты после упаривания, газоочистки, конденсаты технологические прочие",
        ["15"] = "растворы регенрационные (сливы), растворы промывки экстрагентов, сорбентов",
        ["16"] = "воды лабораторий , трапные, обмывочные воды, растворы после дезактивации, включая воды санпропускников и спецпрачечных, сточные воды прочие",
        ["17"] = "воды (декантаты) бассейнов-хранилищ, а также емкостей хранения пульп, фильтратов",
        ["18"] = "воды промысловые",
        ["19"] = "жидкости неорганические прочие",
        ["21"] = "экстрагенты",
        ["22"] = "масла",
        ["23"] = "эмульсии смазочно-охлаждающих жидкостей (СОЖ)",
        ["24"] = "моющие средства (детергенты) за исключением спиртов",
        ["25"] = "спирты",
        ["26"] = "сцинцилляторы органические жидкостные",
        ["29"] = "жидкости органические прочие",
        ["31"] = "хвосты гидрометаллургического-химико-металлургического разделительного и сублиматного производств, пульпы, образующиеся после нейтрализации",
        ["32"] = "пульпы отработавших ионообменных смол и прочих сорбентов органических",
        ["33"] = "шламы и пульпы отработавших сорбентов неорганических, фильтрующих материалов",
        ["34"] = "солевой остаток с солесодержанием до 250 г/л, кубовый остаток",
        ["35"] = "кубовый остаток после упаривания с солесодержанием более 250 г/л, концентрат солевой",
        ["36"] = "взвеси, содержащие продукты коррозии",
        ["37"] = "илы, иловые осадки водемов-накопителей, осадки, кеки",
        ["38"] = "шламы после очистки трапных вод",
        ["39"] = "прочие пульпы, шламы технологические",
        ["41"] = "сталь нержавеющая: крупногабаритные изделия и оборудование",
        ["42"] = "сталь нержавеющая, кроме крупногабаритных изделий",
        ["43"] = "металлые черные, кроме нержавеющей стали: крупногабаритные изделия и оборудование",
        ["44"] = "металлы черные, кроме нержавеющей стали и крупногабаритных изделий",
        ["45"] = "лом черных металлов",
        ["46"] = "металлы щелочные, в том числе отработавший теплоноситель",
        ["51"] = "алюминий и его сплавы, изделия и оборудование из алюминия и его сплавов",
        ["52"] = "уран металлический обедненный и изделия из него",
        ["53"] = "медь и сплавы меди",
        ["54"] = "никель и его сплавы, кроме медно-никелевых сплавов, отнесенных к коду 53",
        ["55"] = "свинец и его сплавы",
        ["56"] = "цирконий и его сплавы",
        ["57"] = "лом цветных металлов прочих, не перечисленных в пунктах 51-57",
        ["58"] = "лом цветных металлов несортированный",
        ["59"] = "металлический лом прочий",
        ["61"] = "сорбенты и фильтрометериалы неорганические",
        ["62"] = "песок",
        ["63"] = "теплоизоляционные материалы неорганические",
        ["64"] = "изделия из стекла и керамики, лабораторная посуда",
        ["65"] = "отходы плавильного производства (включая шлаки, футеровку.)",
        ["66"] = "зола",
        ["67"] = "плав солевой",
        ["68"] = "рудные материалы",
        ["69"] = "твердые РАО неорганические прочие",
        ["71"] = "смолы отработанные ионообменные",
        ["72"] = "уголь активированный, сульфоуголь",
        ["73"] = "полимеры",
        ["74"] = "сажа",
        ["75"] = "спецодежда и другие средства индивидуальной защиты, обувь, обтирочные материалы, ветошь, вата, фильтроэлементы (фильтровальная ткань) фильтров вентиляции",
        ["76"] = "графит",
        ["77"] = "древесина",
        ["78"] = "твердые РАО биологические",
        ["79"] = "твердые РАО органические прочие",
        ["81"] = "ОЗИИИ без защитного контейнера",
        ["82"] = "ОЗИИИ в защитном контейнере",
        ["83"] = "изделия с радиоактивной светомассой постоянного действия (ампулированные источники для ночного обозначения габаритов, аварийные и автономные осветители, указатели, источники света для шквал и циферблатов приборов, подсветки оружейных прицелов и подобное)",
        ["84"] = "открытые радионуклидные источники в виде отдельных изделий",
        ["85"] = "радиоизотопные термоэлектрические генераторы (РИТЭГ)",
        ["86"] = "дымо-, пожароизвещатели",
        ["87"] = "приборы и установки с массой менее 30 кг, содержащие ОЗИИИ",
        ["88"] = "приборы и установки с массой более 30 кг и более, содержащие ОЗИИИ",
        ["89"] = "прочие учетные единицы, содержащие ОЗИИИ",
        ["91"] = "фильтры вентялиционные в сборе",
        ["92"] = "электрокабели",
        ["93"] = "стройматериалы, строительный и прочий мусор",
        ["94"] = "жидкие РАО, подготовленные к передаче национальному оператору",
        ["95"] = "иониозационные камеры(ИК), не содержащие ОЗИИИ",
        ["96"] = "загрязненный грунт, включая керны",
        ["97"] = "поглощающие элементы (стержни-поглотители)",
        ["98"] = "канал измерения нейтронного потока и температуры",
        ["99"] = "прочие типы РАО"
    };

    public static Dictionary<string, Dictionary<string, char>> SignsOperation = new Dictionary<string, Dictionary<string, char>>
    {
        #region Form 1.1
        ["1.1"] = new Dictionary<string, char>
        {
            ["10"] = '0',
            ["11"] = '+',
            ["12"] = '+',
            ["15"] = '+',
            ["17"] = '+',
            ["18"] = '+',
            ["21"] = '-',
            ["22"] = '-',
            ["25"] = '-',
            ["27"] = '-',
            ["28"] = '-',
            ["29"] = '-',
            ["31"] = '+',
            ["32"] = '+',
            ["35"] = '+',
            ["37"] = '+',
            ["38"] = '+',
            ["39"] = '+',
            ["41"] = '-',
            ["42"] = '-',
            ["43"] = '-',
            ["46"] = '-',
            ["47"] = '-',
            ["48"] = '-',
            ["53"] = '0',
            ["54"] = '0',
            ["58"] = '+',
            ["61"] = '0',
            ["62"] = '0',
            ["63"] = '0',
            ["64"] = '0',
            ["65"] = '-',
            ["66"] = '0',
            ["67"] = '-',
            ["68"] = '-',
            ["71"] = '-',
            ["72"] = '-',
            ["73"] = '+',
            ["74"] = '+',
            ["75"] = '+',
            ["81"] = '-',
            ["82"] = '-',
            ["83"] = '-',
            ["84"] = '-',
            ["85"] = '+',
            ["86"] = '+',
            ["87"] = '+',
            ["88"] = '+',
            ["97"] = '+',
            ["98"] = '-',
            ["99"] = '0'
        },
        #endregion
        #region Form 1.2
        ["1.2"] = new Dictionary<string, char>
        {
            ["10"] = '0',
            ["11"] = '+',
            ["12"] = '+',
            ["15"] = '+',
            ["17"] = '+',
            ["18"] = '+',
            ["21"] = '-',
            ["22"] = '-',
            ["25"] = '-',
            ["27"] = '-',
            ["28"] = '-',
            ["29"] = '-',
            ["31"] = '+',
            ["32"] = '+',
            ["35"] = '+',
            ["37"] = '+',
            ["38"] = '+',
            ["39"] = '+',
            ["41"] = '-',
            ["42"] = '-',
            ["43"] = '-',
            ["46"] = '-',
            ["47"] = '-',
            ["48"] = '-',
            ["53"] = '0',
            ["54"] = '0',
            ["58"] = '+',
            ["61"] = '0',
            ["62"] = '0',
            ["63"] = '0',
            ["64"] = '0',
            ["66"] = '0',
            ["67"] = '-',
            ["68"] = '-',
            ["71"] = '-',
            ["72"] = '-',
            ["73"] = '+',
            ["74"] = '+',
            ["75"] = '+',
            ["81"] = '-',
            ["82"] = '-',
            ["83"] = '-',
            ["85"] = '+',
            ["86"] = '+',
            ["87"] = '+',
            ["97"] = '+',
            ["98"] = '-',
            ["99"] = '0'
        },
        #endregion
        #region Form 1.3
        ["1.3"] = new Dictionary<string, char>
        {
            ["10"] = '0',
            ["11"] = '+',
            ["12"] = '+',
            ["15"] = '+',
            ["17"] = '+',
            ["18"] = '+',
            ["21"] = '-',
            ["22"] = '-',
            ["25"] = '-',
            ["27"] = '-',
            ["28"] = '-',
            ["29"] = '-',
            ["31"] = '+',
            ["32"] = '+',
            ["35"] = '+',
            ["37"] = '+',
            ["38"] = '+',
            ["39"] = '+',
            ["41"] = '-',
            ["42"] = '-',
            ["43"] = '-',
            ["46"] = '-',
            ["47"] = '-',
            ["48"] = '-',
            ["53"] = '0',
            ["54"] = '0',
            ["58"] = '+',
            ["61"] = '0',
            ["62"] = '0',
            ["63"] = '0',
            ["64"] = '0',
            ["65"] = '+',
            ["66"] = '0',
            ["67"] = '-',
            ["68"] = '-',
            ["71"] = '-',
            ["72"] = '-',
            ["73"] = '+',
            ["74"] = '+',
            ["75"] = '+',
            ["81"] = '-',
            ["82"] = '-',
            ["83"] = '-',
            ["85"] = '+',
            ["86"] = '+',
            ["87"] = '+',
            ["97"] = '+',
            ["98"] = '-',
            ["99"] = '0'
        },

        #endregion
        #region Form 1.4
        ["1.4"] = new Dictionary<string, char>
        {
            ["10"] = '0',
            ["11"] = '+',
            ["12"] = '+',
            ["15"] = '+',
            ["17"] = '+',
            ["18"] = '+',
            ["21"] = '-',
            ["22"] = '-',
            ["25"] = '-',
            ["27"] = '-',
            ["28"] = '-',
            ["29"] = '-',
            ["31"] = '+',
            ["32"] = '+',
            ["35"] = '+',
            ["37"] = '+',
            ["38"] = '+',
            ["39"] = '+',
            ["41"] = '-',
            ["42"] = '-',
            ["43"] = '-',
            ["46"] = '-',
            ["47"] = '-',
            ["48"] = '-',
            ["53"] = '0',
            ["54"] = '0',
            ["58"] = '+',
            ["61"] = '0',
            ["62"] = '0',
            ["63"] = '0',
            ["64"] = '0',
            ["66"] = '0',
            ["67"] = '-',
            ["68"] = '-',
            ["71"] = '-',
            ["72"] = '-',
            ["73"] = '+',
            ["74"] = '+',
            ["75"] = '+',
            ["81"] = '-',
            ["82"] = '-',
            ["83"] = '-',
            ["85"] = '+',
            ["86"] = '+',
            ["87"] = '+',
            ["97"] = '+',
            ["98"] = '-',
            ["99"] = '0'
        },
        #endregion
        #region Form 1.5
        ["1.5"] = new Dictionary<string, char>
        {
            ["01"] = '+',
            ["10"] = '0',
            ["11"] = '+',
            ["12"] = '+',
            ["13"] = '+',
            ["14"] = '+',
            ["16"] = '+',
            ["18"] = '+',
            ["21"] = '-',
            ["22"] = '-',
            ["25"] = '-',
            ["26"] = '-',
            ["27"] = '-',
            ["28"] = '-',
            ["29"] = '-',
            ["31"] = '+',
            ["32"] = '+',
            ["35"] = '+',
            ["36"] = '+',
            ["37"] = '+',
            ["38"] = '+',
            ["39"] = '+',
            ["41"] = '+',
            ["42"] = '-',
            ["43"] = '-',
            ["44"] = '-',
            ["45"] = '-',
            ["48"] = '-',
            ["49"] = '-',
            ["51"] = '-',
            ["52"] = '+',
            ["55"] = '+',
            ["56"] = '+',
            ["57"] = '+',
            ["59"] = '+',
            ["63"] = '0',
            ["64"] = '0',
            ["68"] = '-',
            ["71"] = '-',
            ["72"] = '-',
            ["73"] = '+',
            ["74"] = '+',
            ["75"] = '+',
            ["76"] = '+',
            ["84"] = '-',
            ["88"] = '+',
            ["97"] = '+',
            ["98"] = '-',
            ["99"] = '0'
        },
        #endregion
        #region Form 1.6
        ["1.6"] = new Dictionary<string, char>
        {
            ["01"] = '+',
            ["10"] = '0',
            ["11"] = '+',
            ["12"] = '+',
            ["13"] = '+',
            ["14"] = '+',
            ["16"] = '+',
            ["18"] = '+',
            ["21"] = '-',
            ["22"] = '-',
            ["25"] = '-',
            ["26"] = '-',
            ["27"] = '-',
            ["28"] = '-',
            ["29"] = '-',
            ["31"] = '+',
            ["32"] = '+',
            ["35"] = '+',
            ["36"] = '+',
            ["37"] = '+',
            ["38"] = '+',
            ["39"] = '+',
            ["41"] = '+',
            ["42"] = '-',
            ["43"] = '-',
            ["44"] = '-',
            ["45"] = '-',
            ["48"] = '-',
            ["49"] = '-',
            ["51"] = '-',
            ["52"] = '+',
            ["55"] = '+',
            ["56"] = '+',
            ["57"] = '+',
            ["59"] = '+',
            ["63"] = '0',
            ["64"] = '0',
            ["68"] = '-',
            ["71"] = '-',
            ["72"] = '-',
            ["73"] = '+',
            ["74"] = '+',
            ["75"] = '+',
            ["76"] = '+',
            ["97"] = '+',
            ["98"] = '-',
            ["99"] = '0',
        },
        #endregion
        #region Form 1.7
        ["1.7"] = new Dictionary<string, char>
        {
            ["01"] = '+',
            ["10"] = '0',
            ["11"] = '+',
            ["12"] = '+',
            ["13"] = '+',
            ["14"] = '+',
            ["16"] = '+',
            ["18"] = '+',
            ["21"] = '-',
            ["22"] = '-',
            ["25"] = '-',
            ["26"] = '-',
            ["27"] = '-',
            ["28"] = '-',
            ["29"] = '-',
            ["31"] = '+',
            ["32"] = '+',
            ["35"] = '+',
            ["36"] = '+',
            ["37"] = '+',
            ["38"] = '+',
            ["39"] = '+',
            ["41"] = '+',
            ["42"] = '-',
            ["43"] = '-',
            ["44"] = '-',
            ["45"] = '-',
            ["48"] = '-',
            ["49"] = '-',
            ["51"] = '-',
            ["52"] = '+',
            ["55"] = '+',
            ["56"] = '+',
            ["57"] = '+',
            ["59"] = '+',
            ["63"] = '0',
            ["64"] = '0',
            ["68"] = '-',
            ["71"] = '-',
            ["72"] = '-',
            ["73"] = '+',
            ["74"] = '+',
            ["75"] = '+',
            ["76"] = '+',
            ["97"] = '+',
            ["98"] = '-',
            ["99"] = '0',
        },
        #endregion
        #region Form 1.8
        ["1.8"] = new Dictionary<string, char>
        {
            ["01"] = '+',
            ["10"] = '0',
            ["11"] = '+',
            ["12"] = '+',
            ["13"] = '+',
            ["14"] = '+',
            ["16"] = '+',
            ["18"] = '+',
            ["21"] = '-',
            ["22"] = '-',
            ["25"] = '-',
            ["26"] = '-',
            ["27"] = '-',
            ["28"] = '-',
            ["29"] = '-',
            ["31"] = '+',
            ["32"] = '+',
            ["35"] = '+',
            ["36"] = '+',
            ["37"] = '+',
            ["38"] = '+',
            ["39"] = '+',
            ["41"] = '+',
            ["42"] = '-',
            ["43"] = '-',
            ["44"] = '-',
            ["45"] = '-',
            ["48"] = '-',
            ["49"] = '-',
            ["51"] = '-',
            ["52"] = '+',
            ["55"] = '+',
            ["56"] = '+',
            ["57"] = '+',
            ["59"] = '+',
            ["63"] = '0',
            ["64"] = '0',
            ["68"] = '-',
            ["71"] = '-',
            ["72"] = '-',
            ["73"] = '+',
            ["74"] = '+',
            ["75"] = '+',
            ["76"] = '+',
            ["97"] = '+',
            ["98"] = '-',
            ["99"] = '0',
        },
        #endregion
        #region Form 1.9
        ["1.9"] = new Dictionary<string, char>
        {
            ["10"] = '0',
            ["11"] = '+',
            ["12"] = '+',
            ["15"] = '+',
            ["17"] = '+',
            ["18"] = '+',
            ["21"] = '-',
            ["22"] = '-',
            ["25"] = '-',
            ["27"] = '-',
            ["28"] = '-',
            ["29"] = '-',
            ["31"] = '+',
            ["32"] = '+',
            ["35"] = '+',
            ["37"] = '+',
            ["38"] = '+',
            ["39"] = '+',
            ["41"] = '-',
            ["42"] = '-',
            ["43"] = '-',
            ["46"] = '-',
            ["47"] = '-',
            ["48"] = '-',
            ["53"] = '0',
            ["54"] = '0',
            ["58"] = '+',
            ["61"] = '0',
            ["62"] = '0',
            ["63"] = '0',
            ["64"] = '0',
            ["66"] = '0',
            ["67"] = '-',
            ["68"] = '-',
            ["71"] = '-',
            ["72"] = '-',
            ["73"] = '+',
            ["74"] = '+',
            ["75"] = '+',
            ["81"] = '-',
            ["82"] = '-',
            ["83"] = '-',
            ["85"] = '+',
            ["86"] = '+',
            ["87"] = '+',
            ["97"] = '+',
            ["98"] = '-',
            ["99"] = '0',
        },
        #endregion
        #region Form 2.12
        ["2.12"] = new Dictionary<string, char>
        {
            ["10"] = '0',
            ["11"] = '+',
            ["12"] = '+',
            ["15"] = '+',
            ["17"] = '+',
            ["18"] = '+',
            ["21"] = '-',
            ["22"] = '-',
            ["25"] = '-',
            ["27"] = '-',
            ["28"] = '-',
            ["29"] = '-',
            ["31"] = '+',
            ["32"] = '+',
            ["35"] = '+',
            ["37"] = '+',
            ["38"] = '+',
            ["39"] = '+',
            ["41"] = '-',
            ["42"] = '-',
            ["43"] = '-',
            ["46"] = '-',
            ["47"] = '-',
            ["48"] = '-',
            ["53"] = '0',
            ["54"] = '0',
            ["58"] = '+',
            ["61"] = '0',
            ["62"] = '0',
            ["63"] = '0',
            ["64"] = '0',
            ["66"] = '0',
            ["67"] = '-',
            ["68"] = '-',
            ["71"] = '-',
            ["72"] = '-',
            ["73"] = '+',
            ["74"] = '+',
            ["75"] = '+',
            ["81"] = '-',
            ["82"] = '-',
            ["83"] = '-',
            ["85"] = '+',
            ["86"] = '+',
            ["87"] = '+',
            ["97"] = '+',
            ["98"] = '-',
            ["99"] = '0'
        }
        #endregion
    };

    /// <summary>
    /// Типы субъектов федерации приводятся в том же порядке, в котором они перечислены в статье 65 Конституции Российской Федерации. 
    /// В пределах каждой из этих категорий субъекты федерации упорядочены по алфавиту.
    /// </summary>
    public static Dictionary<int, string> DictionaryOfSubjectRF = new Dictionary<int, string>
    {
        [1] = "Республика Адыгея (Адыгея)",
        [2] = "Республика Башкортостан",
        [3] = "Республика Бурятия",
        [4] = "Республика Алтай",
        [5] = "Республика Дагестан",
        [6] = "Республика Ингушетия",
        [7] = "Кабардино-Балкарская Республика",
        [8] = "Республика Калмыкия",
        [9] = "Карачаево-Черкесская Республика",
        [10] = "Республика Карелия",
        [11] = "Республика Коми",
        [12] = "Республика Марий Эл",
        [13] = "Республика Мордовия",
        [14] = "Республика Саха (Якутия)",
        [15] = "Республика Северная Осетия — Алания",
        [16] = "Республика Татарстан (Татарстан)",
        [17] = "Республика Тыва",
        [18] = "Удмуртская Республика",
        [19] = "Республика Хакасия",
        [20] = "Чеченская Республика",
        [21] = "Чувашская Республика - Чувашия",
        [22] = "Алтайский край",
        [23] = "Краснодарский край",
        [24] = "Красноярский край",
        [25] = "Приморский край",
        [26] = "Ставропольский край",
        [27] = "Хабаровский край",
        [28] = "Амурская область",
        [29] = "Архангельская область",
        [30] = "Астраханская область",
        [31] = "Белгородская область",
        [32] = "Брянская область",
        [33] = "Владимирская область",
        [34] = "Волгоградская область",
        [35] = "Вологодская область",
        [36] = "Воронежская область",
        [37] = "Ивановская область",
        [38] = "Иркутская область",
        [39] = "Калининградская область",
        [40] = "Калужская область",
        [41] = "Камчатский край",
        [42] = "Кемеровская область — Кузбасс",
        [43] = "Кировская область",
        [44] = "Костромская область",
        [45] = "Курганская область",
        [46] = "Курская область",
        [47] = "Ленинградская область",
        [48] = "Липецкая область",
        [49] = "Магаданская область",
        [50] = "Московская область",
        [51] = "Мурманская область",
        [52] = "Нижегородская область",
        [53] = "Новгородская область",
        [54] = "Новосибирская область",
        [55] = "Омская область",
        [56] = "Оренбургская область",
        [57] = "Орловская область",
        [58] = "Пензенская область",
        [59] = "Пермский край",
        [60] = "Псковская область",
        [61] = "Ростовская область",
        [62] = "Рязанская область",
        [63] = "Самарская область",
        [64] = "Саратовская область",
        [65] = "Сахалинская область",
        [66] = "Свердловская область",
        [67] = "Смоленская область",
        [68] = "Тамбовская область",
        [69] = "Тверская область",
        [70] = "Томская область",
        [71] = "Тульская область",
        [72] = "Тюменская область",
        [73] = "Ульяновская область",
        [74] = "Челябинская область",
        [75] = "Забайкальский край",
        [76] = "Ярославская область",
        [77] = "Москва",
        [78] = "Санкт-Петербург",
        [79] = "Еврейская АО",
        //80
        //81
        //82
        [83] = "Ненецкий АО",
        //84
        //85
        [86] = "Ханты-Мансийский АО - Югра",
        [87] = "Чукотский АО",
        //88
        [89] = "Ямало-Ненецкий АО",
        //90
        [91] = "Республика Крым",
        [92] = "Севастополь",
        //91
        //92
        [93] = "Донецкая Народная Республика",
        [94] = "Луганская Народная Республика",
        //95
        //96
        //97
        //98
        [99] = "Байконур"

        //[dd] = "Запорожская область",
        //[dd] = "Херсонская область",
    };

    public static Dictionary<string, string> OKSM = new Dictionary<string, string>
    {
        ["004"] = "АФГАНИСТАН",
        ["008"] = "АЛБАНИЯ",
        ["010"] = "АНТАРКТИДА",
        ["012"] = "АЛЖИР",
        ["016"] = "АМЕРИКАНСКОЕ САМОА",
        ["020"] = "АНДОРРА",
        ["024"] = "АНГОЛА",
        ["028"] = "АНТИГУА И БАРБУДА",
        ["031"] = "АЗЕРБАЙДЖАН",
        ["032"] = "АРГЕНТИНА",
        ["036"] = "АВСТРАЛИЯ",
        ["040"] = "АВСТРИЯ",
        ["044"] = "БАГАМЫ",
        ["048"] = "БАХРЕЙН",
        ["050"] = "БАНГЛАДЕШ",
        ["051"] = "АРМЕНИЯ",
        ["052"] = "БАРБАДОС",
        ["056"] = "БЕЛЬГИЯ",
        ["060"] = "БЕРМУДЫ",
        ["064"] = "БУТАН",
        ["068"] = "БОЛИВИЯ, МНОГОНАЦИОНАЛЬНОЕ ГОСУДАРСТВО",
        ["070"] = "БОСНИЯ И ГЕРЦЕГОВИНА",
        ["072"] = "БОТСВАНА",
        ["074"] = "ОСТРОВ БУВЕ",
        ["076"] = "БРАЗИЛИЯ",
        ["084"] = "БЕЛИЗ",
        ["086"] = "БРИТАНСКАЯ ТЕРРИТОРИЯ В ИНДИЙСКОМ ОКЕАНЕ",
        ["090"] = "СОЛОМОНОВЫ ОСТРОВА",
        ["092"] = "ВИРГИНСКИЕ ОСТРОВА (БРИТАНСКИЕ)",
        ["096"] = "БРУНЕЙ-ДАРУССАЛАМ",
        ["100"] = "БОЛГАРИЯ",
        ["104"] = "МЬЯНМА",
        ["108"] = "БУРУНДИ",
        ["112"] = "БЕЛАРУСЬ",
        ["116"] = "КАМБОДЖА",
        ["120"] = "КАМЕРУН",
        ["124"] = "КАНАДА",
        ["132"] = "КАБО-ВЕРДЕ",
        ["136"] = "ОСТРОВА КАЙМАН",
        ["140"] = "ЦЕНТРАЛЬНО-АФРИКАНСКАЯ РЕСПУБЛИКА",
        ["144"] = "ШРИ-ЛАНКА",
        ["148"] = "ЧАД",
        ["152"] = "ЧИЛИ",
        ["156"] = "КИТАЙ",
        ["158"] = "ТАЙВАНЬ (КИТАЙ)",
        ["162"] = "ОСТРОВ РОЖДЕСТВА",
        ["166"] = "КОКОСОВЫЕ (КИЛИНГ) ОСТРОВА",
        ["170"] = "КОЛУМБИЯ",
        ["174"] = "КОМОРЫ",
        ["175"] = "МАЙОТТА",
        ["178"] = "КОНГО",
        ["180"] = "КОНГО, ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА",
        ["184"] = "ОСТРОВА КУКА",
        ["188"] = "КОСТА-РИКА",
        ["191"] = "ХОРВАТИЯ",
        ["192"] = "КУБА",
        ["196"] = "КИПР",
        ["203"] = "ЧЕХИЯ",
        ["204"] = "БЕНИН",
        ["208"] = "ДАНИЯ",
        ["212"] = "ДОМИНИКА",
        ["214"] = "ДОМИНИКАНСКАЯ РЕСПУБЛИКА",
        ["218"] = "ЭКВАДОР",
        ["222"] = "ЭЛЬ-САЛЬВАДОР",
        ["226"] = "ЭКВАТОРИАЛЬНАЯ ГВИНЕЯ",
        ["231"] = "ЭФИОПИЯ",
        ["232"] = "ЭРИТРЕЯ",
        ["233"] = "ЭСТОНИЯ",
        ["234"] = "ФАРЕРСКИЕ ОСТРОВА",
        ["238"] = "ФОЛКЛЕНДСКИЕ ОСТРОВА (МАЛЬВИНСКИЕ)",
        ["239"] = "ЮЖНАЯ ДЖОРДЖИЯ И ЮЖНЫЕ САНДВИЧЕВЫ ОСТРОВА",
        ["242"] = "ФИДЖИ",
        ["246"] = "ФИНЛЯНДИЯ",
        ["248"] = "АЛАНДСКИЕ ОСТРОВА",
        ["250"] = "ФРАНЦИЯ",
        ["254"] = "ФРАНЦУЗСКАЯ ГВИАНА",
        ["258"] = "ФРАНЦУЗСКАЯ ПОЛИНЕЗИЯ",
        ["260"] = "ФРАНЦУЗСКИЕ ЮЖНЫЕ ТЕРРИТОРИИ",
        ["262"] = "ДЖИБУТИ",
        ["266"] = "ГАБОН",
        ["268"] = "ГРУЗИЯ",
        ["270"] = "ГАМБИЯ",
        ["275"] = "ПАЛЕСТИНА, ГОСУДАРСТВО",
        ["276"] = "ГЕРМАНИЯ",
        ["288"] = "ГАНА",
        ["292"] = "ГИБРАЛТАР",
        ["296"] = "КИРИБАТИ",
        ["300"] = "ГРЕЦИЯ",
        ["304"] = "ГРЕНЛАНДИЯ",
        ["308"] = "ГРЕНАДА",
        ["312"] = "ГВАДЕЛУПА",
        ["316"] = "ГУАМ",
        ["320"] = "ГВАТЕМАЛА",
        ["324"] = "ГВИНЕЯ",
        ["328"] = "ГАЙАНА",
        ["332"] = "ГАИТИ",
        ["334"] = "ОСТРОВ ХЕРД И ОСТРОВА МАКДОНАЛЬД",
        ["336"] = "ПАПСКИЙ ПРЕСТОЛ (ГОСУДАРСТВО - ГОРОД ВАТИКАН)",
        ["340"] = "ГОНДУРАС",
        ["344"] = "ГОНКОНГ",
        ["348"] = "ВЕНГРИЯ",
        ["352"] = "ИСЛАНДИЯ",
        ["356"] = "ИНДИЯ",
        ["360"] = "ИНДОНЕЗИЯ",
        ["364"] = "ИРАН (ИСЛАМСКАЯ РЕСПУБЛИКА)",
        ["368"] = "ИРАК",
        ["372"] = "ИРЛАНДИЯ",
        ["376"] = "ИЗРАИЛЬ",
        ["380"] = "ИТАЛИЯ",
        ["384"] = "КОТ Д'ИВУАР",
        ["388"] = "ЯМАЙКА",
        ["392"] = "ЯПОНИЯ",
        ["398"] = "КАЗАХСТАН",
        ["400"] = "ИОРДАНИЯ",
        ["404"] = "КЕНИЯ",
        ["408"] = "КОРЕЯ, НАРОДНО-ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА",
        ["410"] = "КОРЕЯ, РЕСПУБЛИКА",
        ["414"] = "КУВЕЙТ",
        ["417"] = "КИРГИЗИЯ",
        ["418"] = "ЛАОССКАЯ НАРОДНО-ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА",
        ["422"] = "ЛИВАН",
        ["426"] = "ЛЕСОТО",
        ["428"] = "ЛАТВИЯ",
        ["430"] = "ЛИБЕРИЯ",
        ["434"] = "ЛИВИЯ",
        ["438"] = "ЛИХТЕНШТЕЙН",
        ["440"] = "ЛИТВА",
        ["442"] = "ЛЮКСЕМБУРГ",
        ["446"] = "МАКАО",
        ["450"] = "МАДАГАСКАР",
        ["454"] = "МАЛАВИ",
        ["458"] = "МАЛАЙЗИЯ",
        ["462"] = "МАЛЬДИВЫ",
        ["466"] = "МАЛИ",
        ["470"] = "МАЛЬТА",
        ["474"] = "МАРТИНИКА",
        ["478"] = "МАВРИТАНИЯ",
        ["480"] = "МАВРИКИЙ",
        ["484"] = "МЕКСИКА",
        ["492"] = "МОНАКО",
        ["496"] = "МОНГОЛИЯ",
        ["498"] = "МОЛДОВА, РЕСПУБЛИКА",
        ["499"] = "ЧЕРНОГОРИЯ",
        ["500"] = "МОНТСЕРРАТ",
        ["504"] = "МАРОККО",
        ["508"] = "МОЗАМБИК",
        ["512"] = "ОМАН",
        ["516"] = "НАМИБИЯ",
        ["520"] = "НАУРУ",
        ["524"] = "НЕПАЛ",
        ["528"] = "НИДЕРЛАНДЫ, КОРОЛЕВСТВО",
        ["531"] = "КЮРАСАО",
        ["533"] = "АРУБА",
        ["534"] = "СЕН-МАРТЕН (нидерландская часть)",
        ["535"] = "БОНЭЙР, СИНТ-ЭСТАТИУС И САБА",
        ["540"] = "НОВАЯ КАЛЕДОНИЯ",
        ["548"] = "ВАНУАТУ",
        ["554"] = "НОВАЯ ЗЕЛАНДИЯ",
        ["558"] = "НИКАРАГУА",
        ["562"] = "НИГЕР",
        ["566"] = "НИГЕРИЯ",
        ["570"] = "НИУЭ",
        ["574"] = "ОСТРОВ НОРФОЛК",
        ["578"] = "НОРВЕГИЯ",
        ["580"] = "СЕВЕРНЫЕ МАРИАНСКИЕ ОСТРОВА",
        ["581"] = "МАЛЫЕ ТИХООКЕАНСКИЕ ОТДАЛЕННЫЕ ОСТРОВА СОЕДИНЕННЫХ ШТАТОВ",
        ["583"] = "МИКРОНЕЗИЯ, ФЕДЕРАТИВНЫЕ ШТАТЫ",
        ["584"] = "МАРШАЛЛОВЫ ОСТРОВА",
        ["585"] = "ПАЛАУ",
        ["586"] = "ПАКИСТАН",
        ["591"] = "ПАНАМА",
        ["598"] = "ПАПУА-НОВАЯ ГВИНЕЯ",
        ["600"] = "ПАРАГВАЙ",
        ["604"] = "ПЕРУ",
        ["608"] = "ФИЛИППИНЫ",
        ["612"] = "ПИТКЕРН",
        ["616"] = "ПОЛЬША",
        ["620"] = "ПОРТУГАЛИЯ",
        ["624"] = "ГВИНЕЯ-БИСАУ",
        ["626"] = "ТИМОР-ЛЕСТЕ",
        ["630"] = "ПУЭРТО-РИКО",
        ["634"] = "КАТАР",
        ["638"] = "РЕЮНЬОН",
        ["642"] = "РУМЫНИЯ",
        ["643"] = "РОССИЯ",
        ["646"] = "РУАНДА",
        ["652"] = "СЕН-БАРТЕЛЕМИ",
        ["654"] = "СВЯТАЯ ЕЛЕНА, ОСТРОВ ВОЗНЕСЕНИЯ, ТРИСТАН-ДА-КУНЬЯ",
        ["659"] = "СЕНТ-КИТС И НЕВИС",
        ["660"] = "АНГИЛЬЯ",
        ["662"] = "СЕНТ-ЛЮСИЯ",
        ["663"] = "СЕН-МАРТЕН (французская часть)",
        ["666"] = "СЕН-ПЬЕР И МИКЕЛОН",
        ["670"] = "СЕНТ-ВИНСЕНТ И ГРЕНАДИНЫ",
        ["674"] = "САН-МАРИНО",
        ["678"] = "САН-ТОМЕ И ПРИНСИПИ",
        ["682"] = "САУДОВСКАЯ АРАВИЯ",
        ["686"] = "СЕНЕГАЛ",
        ["688"] = "СЕРБИЯ",
        ["690"] = "СЕЙШЕЛЫ",
        ["694"] = "СЬЕРРА-ЛЕОНЕ",
        ["702"] = "СИНГАПУР",
        ["703"] = "СЛОВАКИЯ",
        ["704"] = "ВЬЕТНАМ",
        ["705"] = "СЛОВЕНИЯ",
        ["706"] = "СОМАЛИ",
        ["710"] = "ЮЖНАЯ АФРИКА",
        ["716"] = "ЗИМБАБВЕ",
        ["724"] = "ИСПАНИЯ",
        ["728"] = "ЮЖНЫЙ СУДАН",
        ["729"] = "СУДАН",
        ["732"] = "ЗАПАДНАЯ САХАРА",
        ["740"] = "СУРИНАМ",
        ["744"] = "ШПИЦБЕРГЕН И ЯН МАЙЕН",
        ["748"] = "ЭСВАТИНИ",
        ["752"] = "ШВЕЦИЯ",
        ["756"] = "ШВЕЙЦАРИЯ",
        ["760"] = "СИРИЙСКАЯ АРАБСКАЯ РЕСПУБЛИКА",
        ["762"] = "ТАДЖИКИСТАН",
        ["764"] = "ТАИЛАНД",
        ["768"] = "ТОГО",
        ["772"] = "ТОКЕЛАУ",
        ["776"] = "ТОНГА",
        ["780"] = "ТРИНИДАД И ТОБАГО",
        ["784"] = "ОБЪЕДИНЕННЫЕ АРАБСКИЕ ЭМИРАТЫ",
        ["788"] = "ТУНИС",
        ["792"] = "ТУРЦИЯ",
        ["795"] = "ТУРКМЕНИСТАН",
        ["796"] = "ОСТРОВА ТЕРКС И КАЙКОС",
        ["798"] = "ТУВАЛУ",
        ["800"] = "УГАНДА",
        ["804"] = "УКРАИНА",
        ["807"] = "СЕВЕРНАЯ МАКЕДОНИЯ",
        ["818"] = "ЕГИПЕТ",
        ["826"] = "СОЕДИНЕННОЕ КОРОЛЕВСТВО ВЕЛИКОБРИТАНИИ И СЕВЕРНОЙ ИРЛАНДИИ",
        ["831"] = "ГЕРНСИ",
        ["832"] = "ДЖЕРСИ",
        ["833"] = "ОСТРОВ МЭН",
        ["834"] = "ТАНЗАНИЯ, ОБЪЕДИНЕННАЯ РЕСПУБЛИКА",
        ["840"] = "СОЕДИНЕННЫЕ ШТАТЫ",
        ["850"] = "ВИРГИНСКИЕ ОСТРОВА (США)",
        ["854"] = "БУРКИНА-ФАСО",
        ["858"] = "УРУГВАЙ",
        ["860"] = "УЗБЕКИСТАН",
        ["862"] = "ВЕНЕСУЭЛА, БОЛИВАРИАНСКАЯ РЕСПУБЛИКА",
        ["876"] = "УОЛЛИС И ФУТУНА",
        ["882"] = "САМОА",
        ["887"] = "ЙЕМЕН",
        ["894"] = "ЗАМБИЯ",
        ["895"] = "АБХАЗИЯ",
        ["896"] = "ЮЖНАЯ ОСЕТИЯ",

    };

    public static List<short> SprAccObjCodes = [11, 12, 13, 21, 22, 23, 31, 32, 33, 99];

    public static readonly List<short> SprCodeTypesAccObjects = [11, 12, 13, 21, 22, 23, 31, 32, 33, 99];

    public static readonly List<string> SprOpCodes =
    [
        "01", "10", "11", "12", "13", "14", "15", "16", "17", "18", "21", "22", "25", "26", "27", "28", "29", "31",
        "32", "35", "36", "37", "38", "39", "41", "42", "43", "44", "45", "46", "47", "48", "49", "51", "52", "53",
        "54", "55", "56", "57", "58", "59", "61", "62", "63", "64", "65", "66", "67", "68", "71", "72", "73", "74",
        "75", "76", "81", "82", "83", "84", "85", "86", "87", "88", "97", "98", "99"
    ];

    public static readonly List<short> SprOpCodes1 =
    [
        1, 10, 11, 12, 13, 14, 15, 16, 17, 18, 21, 22, 25, 26, 27, 28, 29, 31, 32, 35, 36, 37, 38,
        39, 41, 42, 43, 44, 45, 46, 47, 48, 49, 51, 52, 53, 54, 55, 56, 57, 58, 59, 61, 62, 63, 64,
        65, 66, 67, 68, 71, 72, 73, 74, 75, 76, 81, 82, 83, 84, 85, 86, 87, 88, 97, 98, 99
    ];

    public static readonly List<string> SprRecieverTypeCode =
    [
        "101", "201", "211", "301", "311", "401", "411", "501", "601", "611", "811", "821", "831", "911", "921",
        "991", "102", "202", "212", "302", "312", "402", "412", "502", "602", "612", "812", "822", "832", "912",
        "922", "992", "109", "209", "219", "309", "319", "409", "419", "509", "609", "619", "819", "829", "839",
        "919", "929", "999"
    ];

    public static List<string> SprRefineOrSortCodes =
    [
        "11", "12", "13", "14", "15", "16", "17", "19", "21", "22", "23", "24", "29", "31", "32", "39", "41",
        "42", "43", "49", "51", "52", "53", "54", "55", "61", "62", "63", "71", "72", "73", "74", "79", "99"
    ];

    public static readonly List<Tuple<byte?, string>> SprDocumentVidName =
    [
        new(0, string.Empty),
        new(1, string.Empty),
        new(2, string.Empty),
        new(3, string.Empty),
        new(4, string.Empty),
        new(5, string.Empty),
        new(6, string.Empty),
        new(7, string.Empty),
        new(8, string.Empty),
        new(9, string.Empty),
        new(10, string.Empty),
        new(11, string.Empty),
        new(12, string.Empty),
        new(13, string.Empty),
        new(14, string.Empty),
        new(15, string.Empty),
        new(19, string.Empty),
        new(null, string.Empty)
    ];

    public static List<(string rusName, string latinName, bool isLongLiving, GroupCode groupCode, long mzua, long mza)> SprRadionuclids => SprRadionuclidsTask.Result;

    public static List<Tuple<string, string>> SprTypesToRadionuclids => SprTypesToRadionuclidsTask.Result;

    private static Task<List<(string rusName, string latinName, bool isLongLiving, GroupCode groupCode, long mzua, long mza)>> SprRadionuclidsTask
    {
        get
        {
            var tmp =
#if DEBUG
                Path.Combine(
                    Path.GetFullPath(
                        Path.Combine(
                            AppContext.BaseDirectory, @"..\..\..\..\")), "data", "Spravochniki", "R.xlsx");
#else
                Path.Combine(Path.GetFullPath(AppContext.BaseDirectory), "data", "Spravochniki", "R.xlsx");
#endif
            return ReadRAsync(tmp);
        }
    }

    private static Task<List<Tuple<string, string>>> SprTypesToRadionuclidsTask
    {
        get
        {
            var tmp =
#if DEBUG
                Path.Combine(
                    Path.GetFullPath(
                        Path.Combine(AppContext.BaseDirectory, @"..\..\..\..\")), "data", "Spravochniki", "TypeToRadionuclids.csv");
#else
            Path.Combine(Path.GetFullPath(AppContext.BaseDirectory), "data", "Spravochniki", "TypeToRadionuclids.csv");
#endif
            return ReadCsvAsync1(tmp);
        }
    }

    private static Task<List<(string rusName, string latinName, bool isLongLiving, GroupCode groupCode, long mzua, long mza)>> ReadRAsync(string path)
    {
        return Task.Run(() => ReadR(path));
    }

    private static Task<List<Tuple<string, string>>> ReadCsvAsync1(string path)
    {
        return Task.Run(() => ReadCsv1(path));
    }

    private static List<(string rusName, string latinName, bool isLongLiving, GroupCode groupCode, long mzua, long mza)> ReadR(string path)
    {
        var res = new List<(string, string, bool, GroupCode, long, long)>();
        ExcelPackage.LicenseContext = LicenseContext.NonCommercial;
        FileInfo excelImportFile = new(path);
        var xls = new ExcelPackage(excelImportFile);
        var worksheet = xls.Workbook.Worksheets["Лист1"];
        var i = 2;
        while (worksheet.Cells[i, 1].Text != string.Empty)
        {
            var i1 = worksheet.Cells[i, 1].Text;
            var i2 = worksheet.Cells[i, 4].Text;

            bool isLongLiving = double.TryParse(worksheet.Cells[i, 5].Text, out var halfLifePeriod)
                && worksheet.Cells[i, 6].Text == "лет"
                && halfLifePeriod > 31;

            GroupCode i3;
            #region i3
            switch (worksheet.Cells[i, 8].Text)
            {
                case "а":
                    i3 = GroupCode.Alpha;
                    break;
                case "б":
                    i3 = GroupCode.BetaGamma;
                    break;
                case "у":
                    i3 = GroupCode.Transuranic;
                    break;
                case "т":
                    i3 = GroupCode.Tritium;
                    break;
                default:
                    i3 = GroupCode.NotDefined;
                    break;
            }
            #endregion
            var i4 = long.TryParse(worksheet.Cells[i, 15].Text, out var mzua) ? mzua : 0;
            var i5 = long.TryParse(worksheet.Cells[i, 16].Text, out var mza) ? mza : 0;
            res.Add(new ValueTuple<string, string, bool, GroupCode, long, long>(i1, i2, isLongLiving, i3, i4, i5));
            i++;
        }
        return res;
    }

    private static List<Tuple<string, string>> ReadCsv1(string path)
    {
        var res = new List<Tuple<string, string>>();
        var rows = File.ReadAllLines(path);
        for (var k = 1; k < rows.Length; k++)
        {
            var tmp = rows[k].Split(";", 2);
            var i1 = tmp[0];
            var i2 = tmp[1];
            res.Add(new Tuple<string, string>(i1, i2));
        }
        return res;
    }
}